{
	"tool": "Credential Scanner",
	"suppressions": [
		{
			"file": "src\\OnlineSDK\\Training Samples\\Batching a data action\\README.md",
			"_justification": "It contains api key/secret"
		},
		{
			"file": "src\\OnlineSDK\\Training Samples\\Batching a data action\\src\\modules\\sample-current-conditions\\mocks\\sample-current-conditions.json",
			"_justification": "It contains api key/secret"
		},
		{
			"file": "src\\OnlineSDK\\Extensibility Samples\\Expose salesorder salesline attributes\\src\\themes\\summer\\styles\\modules\\password-reset-verification.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "src\\OnlineSDK\\Extensibility Samples\\Expose salesorder salesline attributes\\src\\themes\\summer\\styles\\modules\\password-reset.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "src\\OnlineSDK\\Extensibility Samples\\Gift Card Personalization\\src\\themes\\summer\\styles\\modules/password-reset-verification.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "source\\src\\OnlineSDK\\Extensibility Samples\\Gift Card Personalization\\src\\themes\\summer\\styles\\modules\\password-reset.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "src\\OnlineSDK\\Training Samples\\Add and consume custom order attributes\\src\\themes\\fabrikam-extended\\styles\\modules\\password-reset-verification.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "src\\OnlineSDK\\Training Samples\\Add and consume custom order attributes\\src\\themes\\fabrikam-extended\\styles\\modules\\password-reset.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "src\\OnlineSDK\\Training Samples\\Custom theme\\src\\themes\\winter\\styles\\modules\\password-reset-verification.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		},
		{
			"file": "src\\OnlineSDK\\Training Samples\\Custom theme\\src\\themes\\winter\\styles\\modules\\password-reset.js",
			"_justification": "There is no password exposed in the file. It is a false positive."
		}
	]
}
